# StringerCurvesNotSplitStairs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StringerCurvesNotSplitStairs Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The slope of stringer may not parallel runs and landings. To get a parallel stringer, split boundary lines at the ends of landings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StringerCurvesNotSplitStairs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StringerCurvesNotSplitStairs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StringerCurvesNotSplitStairs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace